In [1]:
# Initialize Otter
import otter
grader = otter.Notebook("02-exercise-pids2023.ipynb")

ModuleNotFoundError: No module named 'otter'

In [2]:
import numpy as np
from pandas import DataFrame as df
from nose.tools import assert_is_instance, assert_equal, assert_almost_equal, assert_true
import otter
grader = otter.Notebook()

ModuleNotFoundError: No module named 'nose'

# Exercise sheet 2
**Hello everyone!**

This is the first graded exercise sheet. <br>
**Points: 15 **

Topics of this exercise sheet are:
* Work with Jupyter
* See autograding
* Lecture 2: Tidy data, pandas

Please let us know if you have questions or problems! <br>
Contact us during the exercise session, on [ADAM](https://adam.unibas.ch/goto_adam_crs_1266890.html), [Piazza](https://piazza.com/unibas.ch/spring2023/63982), or [via email](https://sada.dmi.unibas.ch/en/teaching/pids23).

Your notebook will be automatically graded using gradescope. Before the exercise session, you should have received an email saying that you were registered to a course in gradescope. If this is not the case, please contact us.

The sheet is released before the exercise session on Tuesday. You have until the next exercise session on Tuesday to submit this sheet. Most of the questions of the exercise sheet can be handle during the session.

**Handout date**: 2023/03/7 <br>
**Submission date**: 2023/03/14 (before 4pm)<br>
**Discussion date**: 2023/03/14

## 1 - Tidy data (9 points)

### A (2 points)
We will use data published by the [World Bank](https://data.worldbank.org/indicator/SP.POP.TOTL) about population in countries.

In [3]:
import pandas as pd

population = pd.read_csv("population_data.csv", skiprows=3).dropna(how='all', axis=1)
population.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54208.0,55434.0,56234.0,56699.0,57029.0,57357.0,...,102050.0,102565.0,103165.0,103776.0,104339.0,104865.0,105361.0,105846.0,106310.0,106766.0
1,Africa Eastern and Southern,AFE,"Population, total",SP.POP.TOTL,130836765.0,134159786.0,137614644.0,141202036.0,144920186.0,148769974.0,...,532760424.0,547482863.0,562601578.0,578075373.0,593871847.0,609978946.0,626392880.0,643090131.0,660046272.0,677243299.0
2,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996967.0,9169406.0,9351442.0,9543200.0,9744772.0,9956318.0,...,30117411.0,31161378.0,32269592.0,33370804.0,34413603.0,35383028.0,36296111.0,37171922.0,38041757.0,38928341.0
3,Africa Western and Central,AFW,"Population, total",SP.POP.TOTL,96396419.0,98407221.0,100506960.0,102691339.0,104953470.0,107289875.0,...,360285439.0,370243017.0,380437896.0,390882979.0,401586651.0,412551299.0,423769930.0,435229381.0,446911598.0,458803476.0
4,Angola,AGO,"Population, total",SP.POP.TOTL,5454938.0,5531451.0,5608499.0,5679409.0,5734995.0,5770573.0,...,24220660.0,25107925.0,26015786.0,26941773.0,27884380.0,28842482.0,29816769.0,30809787.0,31825299.0,32866268.0

**Question 1**:
Manipulate the dataframe "population" to be tidy. Currently, column headers are values, not variable names.

* Make a new dataframe "population_melted" that contains the same data as "population", but
    * it has a new column "Year" containing the year of the observation
    * it has a new column "Population" containing the number of inhabitants of the country in this year
    * otherwise, it has exactly the same columns and data as "population"
*Hint*: you can use 'pd.melt'.

In [4]:
population_melted = pd.melt(population, id_vars = ['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code'], var_name = 'Year', value_name = 'Population')
population_melted

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Population
0,Aruba,ABW,"Population, total",SP.POP.TOTL,1960,54208.0
1,Africa Eastern and Southern,AFE,"Population, total",SP.POP.TOTL,1960,130836765.0
2,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1960,8996967.0
3,Africa Western and Central,AFW,"Population, total",SP.POP.TOTL,1960,96396419.0
4,Angola,AGO,"Population, total",SP.POP.TOTL,1960,5454938.0
...,...,...,...,...,...,...
16221,Kosovo,XKX,"Population, total",SP.POP.TOTL,2020,1775378.0
16222,"Yemen, Rep.",YEM,"Population, total",SP.POP.TOTL,2020,29825968.0
16223,South Africa,ZAF,"Population, total",SP.POP.TOTL,2020,59308690.0
16224,Zambia,ZMB,"Population, total",SP.POP.TOTL,2020,18383956.0
16225,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,2020,14862927.0

In [5]:
grader.check("Question 1")

NameError: name 'grader' is not defined

**Question 2**: Sort the dataframe population_melted by "Country Name" and "Year"

In [6]:
population_melted_sort = population_melted.sort_values(by=['Country Name', 'Year'])
population_melted_sort

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Population
2,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1960,8996967.0
268,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1961,9169406.0
534,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1962,9351442.0
800,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1963,9543200.0
1066,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1964,9744772.0
...,...,...,...,...,...,...
15161,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,2016,14030338.0
15427,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,2017,14236599.0
15693,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,2018,14438812.0
15959,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,2019,14645473.0
16225,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,2020,14862927.0

### B (3 points)
We will use data about the average height in countries around the world. It comes from [Kaggle](https://www.kaggle.com/majyhain/height-of-male-and-female-by-country-2022).

In [7]:
height = pd.read_csv("height_2022.csv")
height.head(-1)

,Rank,Country Name,Male Height in Cm,Female Height in Cm,Male Height in Ft,Female Height in Ft
0,1,Netherlands,183.78,170.36,6.03,5.59
1,2,Montenegro,183.30,169.96,6.01,5.58
2,3,Estonia,182.79,168.66,6.00,5.53
3,4,Bosnia and Herzegovina,182.47,167.47,5.99,5.49
4,5,Iceland,182.10,168.91,5.97,5.54
...,...,...,...,...,...,...
193,194,Guatemala,164.36,150.91,5.39,4.95
194,195,Mozambique,164.30,155.42,5.39,5.10
195,196,Papua New Guinea,163.10,156.89,5.35,5.15
196,197,Solomon Islands,163.07,156.79,5.35,5.14
197,198,Laos,162.78,153.10,5.34,5.02

**Question 3**: Make a new dataframe "height_tidy" where you removed the columns "Male Height in Ft", "Female Height in Ft"

In [8]:
height_tidy = height.drop(['Male Height in Ft', 'Female Height in Ft'], axis = 1)
height_tidy

     Rank            Country Name  Male Height in Cm  Female Height in Cm
0       1             Netherlands             183.78               170.36
1       2              Montenegro             183.30               169.96
2       3                 Estonia             182.79               168.66
3       4  Bosnia and Herzegovina             182.47               167.47
4       5                 Iceland             182.10               168.91
..    ...                     ...                ...                  ...
194   195              Mozambique             164.30               155.42
195   196        Papua New Guinea             163.10               156.89
196   197         Solomon Islands             163.07               156.79
197   198                    Laos             162.78               153.10
198   199             Timor-Leste             160.13               152.71

[199 rows x 4 columns]

In [9]:
grader.check("Question 3")

NameError: name 'grader' is not defined

In [15]:
height_tidy.head()

**Question 4**: Manipulate the dataframe "height_tidy" to be tidy. Currently, multiple variables are stored in one column.

* Make a new dataframe "height_melt" that contains the same data as "height_tidy", but
    * it has a new column "Sex" containing a single character "M" or "F" for "male"/"female"
    * it has a new column "Height in Cm" containing data about the height in cm

In [10]:
height_melt = pd.melt(height_tidy, id_vars = ['Rank', 'Country Name'], var_name = 'Sex', value_name = 'Height in Cm')
height_melt['Sex'] = height_melt['Sex'].replace({'Male Height in Cm': 'M', 'Female Height in Cm': 'F'})
height_melt.head(5)

   Rank            Country Name Sex  Height in Cm
0     1             Netherlands   M        183.78
1     2              Montenegro   M        183.30
2     3                 Estonia   M        182.79
3     4  Bosnia and Herzegovina   M        182.47
4     5                 Iceland   M        182.10

In [11]:
grader.check("Question 4")

NameError: name 'grader' is not defined

### C (4 points)
We will work with data about billboards in the 2000s (as in the lecture).

In [12]:
billboard = pd.read_csv("billboard_intermediate.csv")
billboard.head()

,year,artist.inverted,track,time,genre,date,date.peaked,week,rank
0,2000,Nelly,(Hot S**t) Country Grammar,4:17,Rap,2000-04-29,2000-09-16,1,100.0
1,2000,Nelly,(Hot S**t) Country Grammar,4:17,Rap,2000-05-06,2000-09-16,2,99.0
2,2000,Nelly,(Hot S**t) Country Grammar,4:17,Rap,2000-05-13,2000-09-16,3,96.0
3,2000,Nelly,(Hot S**t) Country Grammar,4:17,Rap,2000-05-20,2000-09-16,4,76.0
4,2000,Nelly,(Hot S**t) Country Grammar,4:17,Rap,2000-05-27,2000-09-16,5,55.0

**Question 5:**: Manipulate the dataframe "billboard" into two dataframes that each store one observational unit.

* Make a new dataframe "billboard_songs" that contains information about the songs
    * It should contain these columns from the "billboard" dataframe: "artist.inverted", "track", "time", "genre"
* Make a new dataframe "billboard_charts" that contains information about the chart performance of the songs
    * It should contain these columns from the "billboard" dataframe: "date", "date.peaked", "week", "rank"
* Additionally, both dataframes should contain a column named "track_id" that gives each track a unique ID and links the information in the two dataframes.

(Hint: Pandas has a function [.groupby().ngroup()](https://stackoverflow.com/questions/39665374/how-to-make-a-group-id-using-pandas) that could help you with the track id)

In [1]:
billboard_songs = billboard[["artist.inverted", "track", "time", "genre"]].drop_duplicates()
billboard_songs['track_id'] = billboard_songs.groupby(['track']).ngroup() #create a new column that assigns a unique value to each unique track
billboard_songs

NameError: name 'billboard' is not defined

In [2]:
billboard_charts = billboard[["date", "date.peaked", "week", "rank"]]
billboard_charts['track_id'] = billboard.groupby(['track']).ngroup()
billboard_charts

NameError: name 'billboard' is not defined

In [15]:
grader.check("Question 5")

NameError: name 'grader' is not defined

## 2 - EDA (6 points)

### A (2 points)
Let's answer one more question about billboard hits in the 2000s. Use the billboard, billboard_songs or billboard_charts dataframes.

**Question 6**: What was the number one hit (rank = 1) on 2000/07/29? This question may seem random (and it is), but this is the 2000s! This is the day on which Jennifer Aniston married Brad Pitt. Did they play this song? Who knows.

* Define one variable
    * "name_song": Name of the song that was at rank 1 on the given date

In [17]:
name_song = billboard.loc[(billboard['date.peaked'] == '2000-07-29') & (billboard['rank'] == 1), 'track']
name_song

10728    It's Gonna Be Me
10729    It's Gonna Be Me
Name: track, dtype: object

### 2b (4 points)
Let's answer some questions about average heights. Use the height, height_tidy or height_melt dataframes.

**Question 7**: What's the country with the tallest men?

* Define two variables
    * "country_tallest_men": Name of the country of tallest men as a string
    * "height_tallest_men": Average height of men in this country in cm

(Hint: Pandas function max() can help here!)

In [18]:
max_height_index = height_tidy['Male Height in Cm'].idxmax()
country_tallest_men = height_tidy.loc[max_height_index, 'Country Name']
country_tallest_men

'Netherlands'

**Question8**: In which country is the difference of average heights between men and women largest?

* Define two variables
    * "country_largest_difference": Name of the country where the average height difference between men and women is largest
    * "largest_difference": Difference of average heights of men and women in this country in cm

In [19]:
height_tallest_men = max(height_tidy['Male Height in Cm'])
height_tallest_men

183.78

In [20]:
height_tidy['difference height'] = height_tidy['Male Height in Cm'] - height_tidy['Female Height in Cm']
height_tidy

,Rank,Country Name,Male Height in Cm,Female Height in Cm,difference height
0,1,Netherlands,183.78,170.36,13.42
1,2,Montenegro,183.30,169.96,13.34
2,3,Estonia,182.79,168.66,14.13
3,4,Bosnia and Herzegovina,182.47,167.47,15.00
4,5,Iceland,182.10,168.91,13.19
...,...,...,...,...,...
194,195,Mozambique,164.30,155.42,8.88
195,196,Papua New Guinea,163.10,156.89,6.21
196,197,Solomon Islands,163.07,156.79,6.28
197,198,Laos,162.78,153.10,9.68
198,199,Timor-Leste,160.13,152.71,7.42

In [21]:
max_height_difference_index = height_tidy['difference height'].idxmax()
country_largest_difference = height_tidy.loc[max_height_difference_index, 'Country Name']
country_largest_difference

'Puerto Rico'

In [22]:
largest_difference = max(height_tidy['difference height'])
largest_difference

16.419999999999987

**Question 9**: What's (Pearson's) correlation value of average male and average female height?

* Define a new variable "corr_avg_heights" that contains the correlation value of average male and female heights

(Hint: Use Panda's function corr().)

In [23]:
corr_avg_heights = height_tidy['Male Height in Cm'].corr(height_tidy['Female Height in Cm'])
corr_avg_heights

0.9287870871295012

In [ ]:
grader.check("Question 9")

---

To double-check your work, the cell below will rerun all of the autograder tests.

In [ ]:
grader.check_all()

## Submission

Make sure you have run all cells in your notebook in order before running the cell below, so that all images/graphs appear in the output. The cell below will generate a zip file for you to submit. **Please save before exporting!**

In [ ]:
# Save your notebook first, then run this cell to export your submission.
grader.export()